[
  {
    "company": "VN Solution - VSOL",
    "location": "HCMC, Vietnam",
    "terms": [
      {
        "term": "Nov 2025 - Now",
        "employment_type": "Full-time",
        "role": "Senior Software Engineer",
        "responsibilities": [
          "Developed UI features for IoT products and maintained existing repositories to ensure a stable and responsive user experience.",
          "Built Cypress E2E automated tests covering authentication flows, using AI-assisted test case generation and review to improve test coverage."
        ]
      }
    ]
  },
  {
    "company": "Hello Health Group",
    "location": "HCMC, Vietnam",
    "terms": [
      {
        "term": "May 2021 - Oct 2025",
        "employment_type": "Full-time",
        "role": "Senior Front-End Engineer",
        "responsibilities": [
          "Developed and maintained responsive user interfaces using React.js, Next.js, and modern UI frameworks such as Mantine V6, AntDesign, and Tailwind CSS",
          "Collaborated with backend teams to integrate RESTful APIs, ensuring smooth data communication between client and server.",
          "Supported and enhanced legacy applications while contributing to new feature development to improve functionality and UX.",
          "Converted Figma designs into pixel-perfect, user-friendly interfaces in close collaboration with UX and design teams.",
          "Mentored interns in adopting Git-based workflows, enhancing team collaboration and improving code review quality across projects."
        ]
      }
    ]
  },
  {
    "company": "Zivas",
    "location": "HCMC, Vietnam",
    "terms": [
      {
        "term": "Feb 2020 – Apr 2021",
        "employment_type": "Full-time",
        "role": "Front-End Engineer",
        "responsibilities": [
          "Built responsive websites using a mobile-first concept, ensuring seamless display and performance on smartphones, tablets, and desktops.",
          "Implemented a WordPress theme from Figma/Adobe XD UI/UX and created custom post types with category-based filtering for improved content management."
        ]
      }
    ]
  },
  {
    "company": "Corsiva Lab Pte Ltd",
    "location": "Singapore",
    "terms": [
      {
        "term": "Aug 2019 – Feb 2020",
        "employment_type": "Full-time",
        "role": "Front-End Developer",
        "responsibilities": [
          "Used the TypeRocket framework to build a drag-and-drop page layout system within the WordPress CMS.",
          "Built and updated WordPress themes aligned with marketing specifications, leveraging Elementor and Advanced Custom Fields (ACF).",
          "Created responsive website layouts with HTML, CSS, and JavaScript, and transformed them into WordPress themes for dynamic content management."
        ]
      }
    ]
  },
  {
    "company": "Munkas Agency",
    "location": "HCMC, Vietnam",
    "terms": [
      {
        "term": "Mar 2017 – Aug 2019",
        "employment_type": "Full-time",
        "role": "Front-End Developer",
        "responsibilities": [
          "Translated Adobe Photoshop and Illustrator designs into responsive WordPress themes with drag-and-drop functionality, powered by ACF, TypeRocket, and Elementor for streamlined content editing.",
          "Maintained and updated existing WordPress websites, including theme/plugin management, and handled deployment via cPanel/DirectAdmin with full support for FTP setup, DNS configuration, and MySQL database import/export."
        ]
      }
    ]
  }
]
